package com.example.recycleviewex;

public class myData {

    static String[] nameArray = {"Aang", "Katara", "Sokka", "Toph", "Zuko", "Iroh", "Azula", "Ozai"};
    static String[] DescriptionArray = {"אנג הוא כשף האוויר האחרון וגם האווטאר ששולט בכל 4 האלמנטים - מים,אוויר,אדמה ואש. לפני שנים רבות אנג קפא במים ובזמן שהעולם היה הכי צריך אותו הוא נעלם ואומת האש כבשה את העולם. לאחר 100 שנים מצאו את אנג והוא רק ילד אשר צריך ללמוד לשלוט בכל האלמנטים ולהציל את העולם!\n" +
            "\n",
            "קטארה היא אחותו של סוקה, היא כשפית המים האחרונה שניצלה מהמתקפה על שבט המים הדרומי. עם הזמן היא לומדת לכשף מים ולעזור לאנג ללמוד גם.\n" +
                    "\n",
            "סוקה הוא אחיה של קטארה, הוא אינו מכשף אבל לוחם דגול. כאשר קטארה וסוקה איבדו את הוריהם, סוקה נהיה זה ששומר על שבט המים הדרומי.",
            "טוף היא כשפית אדמה. את טוף פגשו במהלך הפלישה לשבא האדמה. טוף עיוורת ותפקידה היה ללמד את אנג כשפות אדמה.\n" + "\n.",
            "זוקו הוא הבן של אוזאי שליט אומת האש. צוקו נסיך שגורש משבט האש מכיוון שלא היה אכזרי מידי כמו שאביו רצה. מהותו של צוקו היא ללכוד אצ האווטאר ולהביא אותו אל שליט האש. במהלך הסדרה צוקו מבין שכדאי לו לחבור אל אנג ולא לעזור לאביו ההרסני. הוא עושה זאת בעזרת דודו אירו.\n" +
                    "\n\n" +
                    "\n",
            "אירו הוא הדוד של צוקו ואחיו של אוזאי. אירו גנרל בעל עוצמה רבה אך לב טוב. תפקידו של אירו הוא להתוות לצוקו דרך חדשה ממה שלמד מאביו ולשנות אותו.",
            "אזולה היא אחותו של צוקו. היא לא יורשת הכס אלא צוקו והיא ידועה בתחבולותיה והאסטרטגיות לחימה שלה. מה שהרס אותה הוא ההרס העצמי שלה.",
            "אוזאי הוא שליט האש. מהותו היא לכבוש את העולם. הוא זה שהתחיל את המלחמה ולאחר שגילו שהאווטאר חזר הוא עשה כל שביכולתו על מנת לעצור את אנג ולשלוט בעולם כולו.\n" +
                    "\n",
            };

    static Integer[] drawableArray = {R.drawable.aang, R.drawable.katara, R.drawable.sokka,
            R.drawable.toph, R.drawable.zuko, R.drawable.iroh,
            R.drawable.azula, R.drawable.ozai};

    static Integer[] id_ = {0, 1, 2, 3, 4, 5, 6, 7, 8};

}